import sayHello, {minimal,maximal,double,triple,sayGoodbye} from "./script.js"


// 1
let arra = [1,5,8,4,2,5,8,3,1]

console.log(minimal(arra))
console.log(maximal(arra))


// 2
console.log(double(2))
console.log(triple(4))

// 3
console.log(sayHello())
console.log(sayGoodbye())


// level 93:
// 1) შექმენი ფაილი, სადაც არის ორი ფუნქცია:
// ერთი პოულობს მასივში ყველაზე პატარა რიცხვს
// მეორე პოულობს ყველაზე დიდ რიცხვს
// მეორე ფაილში დააიმპორტე ეს ფუნქციები და გამოიყენე ერთ მასივზე.
// 2) შექმენი ფაილი, სადაც ორი ფუნქციაა:
// ერთი რიცხვს აორმაგებს
// მეორე რიცხვს ასამმაგებს
// 3) შექმენი ფაილი, სადაც:
// default export არის ფუნქცია, რომელიც მომხმარებელს ესალმება
// დამატებით export არის ფუნქცია, რომელიც ემშვიდობება
// 4) შექმენი ფაილი, სადაც არის ორი ფუნქცია:
// ერთი ტექსტს დიდ ასოებად აქცევს
// მეორე პატარა ასოებად
// 5) შექმენი ერთი ფაილი, სადაც ორი ფუნქციაა: შეკრება და გამოკლება.
// მეორე ფაილში დააიმპორტე ეს ფუნქციები და გამოიტანე მათი შედეგები.