// level 78:
// 1) შექმენი რიცხვების მასივი 3, 6, 9, 12, 15, 18.
// თითოეული რიცხვი გაზარდე ორჯერ,
// დატოვე მხოლოდ ის შედეგები, რომლებიც 20-ზე მეტია,
// იპოვე მათი ჯამი
// და ბოლოს დაბეჭდე რამდენი რიცხვი დარჩა.
let nums1 = [3,6,9,12,15,18]

new_nums1 = nums1.map(n => n * 3).filter(a => a > 20)
newSumNums1 = new_nums1.reduce((acc,curr) => {
    return acc + curr
}, 0)
console.log(new_nums1.length)
console.log(newSumNums1)
// 2) შექმენი რიცხვების მასივი 5, 11, 2, 8, 14, 7.
// დატოვე მხოლოდ ლუწი რიცხვები,
// თითოეული მათგანი აიყვანე კვადრატში,
// დაალაგე მიღებული რიცხვები ზრდადობით
// და ეკრანზე გამოიტანე თითოეული მათგანი.
let num2 = [5,11,2,8,14,7]

let newNum2 = num2.filter(a => a % 2 == 0).map(b => b * b).sort((c,d) => c - d)

console.log(newNum2)

// 3) შექმენი რიცხვების მასივი 1, 3, 5, 7, 9.
// თითოეულ რიცხვს დაუმატე მისი პოზიციის ნომერი მასივში,
// დატოვე მხოლოდ ის შედეგები, რომლებიც კენტია,
// და გამოთვალე მათი ნამრავლი.
let numbers = [1, 3, 5, 7, 9];

let product = numbers.map((num, index) => num + index).filter(num => num % 2 !== 0) .reduce((acc, num) => acc * num, 1);  

console.log(product);

// 4) შექმენი რიცხვების მასივი -8, -2, 0, 3, 6, 9, 11.
// ამოიღე ყველა უარყოფითი რიცხვი,
// დარჩენილი რიცხვებიდან თითოეულს დაუმატე 5,
// დატოვე მხოლოდ 10-ზე ნაკლები შედეგები
// და დაბეჭდე ისინი.

let num4 = [-8, -2, 0, 3, 6, 9, 11]

let newNum4 = num4.filter(a => a > 0).map(b => b + 5).filter(c => c > 10)

console.log(newNum4)

// 5) შექმენი რიცხვების მასივი 4, 8, 12, 16, 20.
// თითოეული რიცხვი გაყავი 2-ზე,
// იპოვე მიღებული რიცხვების ჯამი და გამოიტანე შედეგი.
let num5 = [4, 8, 12, 16, 20]
let newNum5 = num5.map(a => a / 2).reduce((acc,curr) => {return acc + curr}, 0)
console.log(newNum5)


// 6) შექმენი რიცხვების მასივი 2, 4, 6, 8, 10, 12.
// თითოეული რიცხვი გაზარდე 3-ჯერ,
// დატოვე მხოლოდ ის შედეგები, რომლებიც 20-ს არ აღემატება,
// გამოთვალე მათი ჯამი
// და დაბეჭდე ყველაზე პატარა მიღებული რიცხვი.
let num6 = [2, 4, 6, 8, 10, 12]
let newNum6 = num6.map(a => a * 3).filter(b => b > 20)
let sumNum6 = newNum6.reduce((acc,curr) => {return acc + curr}, 0)
console.log(sumNum6)

console.log(newNum6.shift())

// 7) შექმენი რიცხვების მასივი 1, 5, 10, 15, 20.
// თითოეულ რიცხვს გამოაკელი 1,
// დატოვე მხოლოდ ის შედეგები, რომლებიც 10-ზე მეტია,
// დაალაგე მიღებული რიცხვები კლებადობით
// და ეკრანზე გამოიტანე ყველა ელემენტი.
let num7 = [1, 5, 10, 15, 20]
let newNum7 = num7.map(a => a - 1).filter(b => b > 10).sort((a,b) => {return b - a})

console.log(newNum7)

// 8) შექმენი რიცხვების მასივი 3, 5, 7, 9, 11.
// თითოეული რიცხვი გაამრავლე საკუთარ თავზე,
// დატოვე მხოლოდ ის შედეგები, რომლებიც ლუწია,
// გამოთვალე რამდენი ასეთი რიცხვი მიიღება
// და დაბეჭდე ეს რაოდენობა.
let num8 = [3, 5, 7, 9, 11]
let newNum8 = num8.map(a => a * a).filter(b => b % 2 == 0)

console.log(newNum8.length)