// 1) მოცემულია წიგნების ავტორების მასივი. დაწერეთ პროგრამა, რომელიც დააჯგუფებს ავტორებს და
//  დაითვლის რამდენი წიგნი აქვს თითოეულ ავტორს. შედეგი შეინახეთ ობიექტში. ამოცანა შეასრულეთ 
//  reduce მეთოდის გამოყენებით.
const autors = [
    'jk rowling',
    'franc kafka',
    'leo tolstoy',
    'fiodor dostoevsky',
    'ilia wavwavadze',
    'vaja fshavela',
    'franc kafka'
]

let r = autors.reduce((acc,curr) => {
    acc[curr] = (acc[curr] || 0) + 1
    return acc
}, {})

console.log(r)

// 2) მოცემულია ონლაინ მაღაზიაში მომხმარებლების მიერ დახარჯული თანხების მასივი. დაწერეთ პროგრამა, 
// რომელიც დაადგენს რამდენი მომხმარებელი ეკუთვნის შემდეგ კატეგორიებს:
// მცირე ხარჯვა — 100-ზე ნაკლები
// საშუალო ხარჯვა — 100-დან 499-ის ჩათვლით
// დიდი ხარჯვა — 500 და მეტი
// ამოცანა შეასრულეთ forEach მეთოდის გამოყენებით.

const a = [100,400,53,752,613,1578,4234,123,5]

const c = {
    patara: 0,
    sashualo: 0,
    didi: 0
}

a.forEach(cash => {
    if(cash < 100) {
        c.patara += 1
    }
    else if(cash <= 499) {
        c.sashualo += 1
    }
    else {
        c.didi += 1
    }
})

console.log(c)

// 3) მოცემულია თამაშის მოთამაშეების სია, სადაც თითოეულ მოთამაშეს აქვს სახელი და მოგებული ქულები.
//  დაწერეთ პროგრამა, რომელიც იპოვის მოთამაშეს, რომელსაც ყველაზე ნაკლები ქულა აქვს. ამოცანა შეასრულეთ 
//  reduce მეთოდის გამოყენებით.


// 4) მოცემულია თანამშრომლების სია სამუშაო საათებით. დაწერეთ პროგრამა, რომელიც დაადგენს რამდენმა 
// თანამშრომელმა იმუშავა 40 ან მეტი საათი, რამდენმა ნაკლები, ასევე გამოითვლის ყველა თანამშრომლის ნამუშევარი 
// საათების ჯამსა და საშუალოს. ამოცანა შეასრულეთ reduce მეთოდის გამოყენებით.


// 5) მოცემულია ტექსტი. დაწერეთ პროგრამა, რომელიც დაითვლის რამდენი სიტყვა იწყება ხმოვანი ასოთი 
// (a, e, i, o, u — ინგლისურად ან ა, ე, ი, ო, უ — ქართულად). ამოცანა შეასრულეთ reduce მეთოდის გამოყენებით.


// 6) მოცემულია საწყობში არსებული პროდუქციის სია, სადაც თითოეულ პროდუქტს აქვს ფასი და საწყობში 
// არსებული რაოდენობა. დაწერეთ პროგრამა, რომელიც თითოეული პროდუქტის საერთო ღირებულებას გამოთვლის
//  და შემდეგ დაადგენს საწყობის სრული მარაგის ფასს. ამოცანა შეასრულეთ forEach და reduce მეთოდების გამოყენებით.


// 7) მოცემულია რიცხვების მასივი. დაწერეთ პროგრამა, რომელიც დაითვლის რამდენი რიცხვია 0-დან 50-მდე
// , რამდენი 51-დან 100-მდე და რამდენი 100-ზე მეტია. ამოცანა შეასრულეთ forEach მეთოდის გამოყენებით.