// 1) მოცემულია ასაკებისგან შემდგარი რიცხვითი მასივი.
// დაწერეთ პროგრამა, რომელიც დაითვლის, რამდენჯერ
//  გვხვდება მასივში თითოეული ასაკი და შედეგს შეინახავს ობიექტში.
// ამოცანა შეასრულეთ reduce მეთოდის გამოყენებით.
let userAges = [30,53,21,53,19,35,40]
const count = userAges.reduce((acc, curr) => {
    acc[curr] = (acc[curr] || 0) + 1
    return acc
}, {})

console.log(count)

// 2) მოცემულია ქულებისგან შემდგარი მასივი.
// დაწერეთ პროგრამა, რომელიც დაადგენს, რამდენი
//  ქულა ეკუთვნის დაბალ, საშუალო და მაღალ კატეგორიას, სადაც:
// დაბალი — 40-ზე ნაკლები,
// საშუალო — 40-დან 69-ის ჩათვლით,
// მაღალი — 70 და მეტი.
// ამოცანა შეასრულეთ forEach მეთოდის გამოყენებით.
let stars = [10,50,55,100,70,60,30,25]
let eachStars = {dabali: 0, sashualo: 0, magali: 0}
stars.forEach((avg) => {
    if (avg < 40) {
        eachStars.dabali += 1;
    }
    else if(avg >= 69) {
        eachStars.sashualo += 1;
    }
    else {
        eachStars.magali += 1
    }

})

console.log(eachStars)




// 3) მოცემულია მოსწავლეთა სია, სადაც თითოეულ მოსწავლეს აქვს სახელი და ქულა.
// დაწერეთ პროგრამა, რომელიც იპოვის იმ მოსწავლეს, ვისაც ყველაზე მაღალი ქულა აქვს.
// ამოცანა შეასრულეთ reduce მეთოდის გამოყენებით.

// 4) მოცემულია მოსწავლეთა სია ქულებით.
// დაწერეთ პროგრამა, რომელიც დაადგენს რამდენმა მოსწავლემ ჩააბარა გამოცდა (ქულა ≥ 50), რამდენმა ვერ ჩააბარა, ასევე გამოითვლის ქულების ჯამსა და საშუალო ქულას.
// ამოცანა შეასრულეთ reduce მეთოდის გამოყენებით.

// 5) მოცემულია ტექსტი.
// დაწერეთ პროგრამა, რომელიც დაითვლის ტექსტში თითოეული სიტყვის გამეორების რაოდენობას.
// ამოცანა შეასრულეთ reduce მეთოდის გამოყენებით.

// 6) მოცემულია პროდუქტების სია, სადაც თითოეულ პროდუქტს აქვს ფასი და რაოდენობა.
// დაწერეთ პროგრამა, რომელიც თითოეული პროდუქტის საერთო ღირებულებას გამოთვლის და შემდეგ დაადგენს ყველა პროდუქტის ჯამურ ფასს.
// ამოცანა შეასრულეთ forEach და reduce მეთოდების გამოყენებით.

// 7) მოცემულია რიცხვებისგან შემდგარი მასივი.
// დაწერეთ პროგრამა, რომელიც დაითვლის რამდენი ლუწი და რამდენი კენტი რიცხვია მასივში.
// ამოცანა შეასრულეთ forEach მეთოდის გამოყენებით.