// 1) კომენტარების სახით ახსენით რა არის მასივი.
// 2) შექმენი შენი მეგობრების array.
// 3) უკვე შექმნილი array-დან ამოიღეთ პირველი და ბოლო ელემენტები.
// 4) უვე შექმნილ array-ში დაამატეთ თქვენი თავი (სახელი ან გვარი)
// 5) უვე შექმნილ array-დან დაწალე ბოლო ელემენტი
// 6) შექმენი მასივი let nums = [10, 20, 30, 40, 50]; და slice() ფუნქციით გამოიტანე მხოლოდ პირველი ორი ელემენტი.
// 7) შექმენი მასივი let colors = ["red", "green", "blue", "yellow", "black"]; და slice-ის გამოყენებით შექმენი ახალი მასივი, სადაც იქნება მხოლოდ "green" და "blue".


// 1
/* მასივი არის ცვლადი რომელიც ინახავს ბევრ მნიშვნელობას, შეგვიძლია აღვიქვათ როგორც ცვლადი რომელსაც აქვს 
რამოდენიმე მნიშვნელობა. მნიშვნელობები შეიძლება იყოს ნებისმიერი ტიპის, სტრინგი, ინტეჯერი თუ სხვა. მასივების რამოდენიმე მახასიათებელი აქვს რითაც ვხვდებით არის თუ არა
ის მასივი, მასივები ინახება [] ებში და ახასიათებთ indexing, ასევე თუ ცვლადი იქმნება ესე: const new Array = () ან const arr = [] უკვე ვიცით რომ ეს არის მასივი.
*/

// 2
let friendsArr = ['gio','dato','nika']

// 3
friendsArr.pop()
friendsArr.shift()

// 4
friendsArr.push('vato')

// 5
friendsArr.pop()

console.log(friendsArr)

// 6
let nums = [10, 20, 30, 40, 50];
let numsChange = nums.slice(0,2)
console.log(numsChange)

// 7
let colors = ["red", "green", "blue", "yellow", "black"];
let newColors = colors.slice(1,3)
console.log(newColors)