// level 91:
// 1.კომენტარებით ახსენით რა არის ES6
// ეს არის ვერსია როდესაც დაემატა let,const,arrow function, class,destructuring და კიდევ ძალიან ბევრი რამ.

// 2.კომენტარებით ახსენით რა არის მოდული.
// მოდულების გამოყენებით ჩვენ შეგვიძლია კოდის იმპორტირება მოვახდინოთ ერთი ფაილიდან მეორეში (ექსპორტი)

// 3.კომენტარებით ახსენით რა არის ექსპორტი/def export/named export.
// ექსპორტი არის ინფრომაციის გადატანა.

// 4.კომენტარებით ახსენით რა არის იმპორტი.
// ექპორტირებული ინფრომაციის შემოტანა მეორე ფაილში

// 5.შექმენი ფაილი mathUtils.js. დაწერე ორი 
// ფუნქცია double(n) და triple(n).
//  double აბრუნებს რიცხვის ორმაგს და triple 
// აბრუნებს რიცხვის სამმაგს. 
// ორივე გააკეთე named export. შემდეგ შექმენი app.js,
//  დააიმპორტე ორივე
//  ფუნქცია და გამოიტანე console.log-ში რამდენიმე მაგალითი.

// დავალება 5
import {double,triple} from "./second.js";
// დავალება 6
import sumTo from "./second.js"
// დავალება 7
import { getEvenNumbers } from "./second.js";


// დავალება 5
console.log(double(10))
console.log(triple(3))

// დავალება 6
console.log(sumTo(10))

// დავალება 7
console.log(getEvenNumbers([4,6,8,2,4,1,20,12,623,123,5,6,234,23,1,2,4,8]))




// 6.
// შექმენი ფაილი sumNumbers.js. დაწერე ფუნქცია sumTo(n) 
// რომელიც for 
// loop-ის გამოყენებით დაითვლის 1-დან n-მდე რიცხვების ჯამს
//  და დააბრუნებს შედეგს. ეს ფუნქცია გააკეთე
// default export. შემდეგ main.js-ში
//  დააიმპორტე ეს ფუნქცია და გამოიძახე console.log-ში.

// 7.
// შექმენი ფაილი arrayUtils.js. დაწერე ფუნქცია
//  getEvenNumbers(arr) რომელიც 
// მიიღებს რიცხვების array-ს, for loop-ის გამოყენებით 
// იპოვის ყველა ლუწ რიცხვს
//  და დააბრუნებს ახალ array-ს ამ რიცხვებით. ეს ფუნქცია 
// გააკეთე named export.
//  შემდეგ app.js-ში დააიმპორტე ფუნქცია და გამოიტანე შედეგი
//  console.log-ში.

